package project2_1;

public class Spt {
	// 생성자
	// 생성자는 리턴타입 x
	
	//등록
	
	//추가
	
	//출력
		// 0번 인덱스부터 시작해서 현재 저장된 연락처의 갯수만큼 스캔
					// 1번 연락처~ 5번 연락처 까지 스캔시 (cnt =5)
					// 인덱스는 0부터 4까지(총 5명)
					// 따라서 i는 0 부터 4까지 스캔

		            // 해당 배열 연락처의 이름만 출력
	
	//검색한이름 찾는기능
		// 전체 배열을 돌면서 같은 이름이 있는 연락처가
				// 배열의 몇번째 인덱스에 있는지 (i 번쨰 인덱스)
				// 찾아서 index 에 할당.
				// 따라서 같은 이름이 있으면 index 는 i 가 되고
				// 없으면 index에 i가 할당되지 않는다.
	
	//수정
	
	//삭제
		// index <0 의 반대 >> index가 0보다 같거나 크다면 >> 같은 이름을 찾았다

					// 같은 이름의 연락처는 index 번 인덱스에 있다.
					// for 문을 돌면서 그 index 번 연락처를 index+1 번 연락처로 덮어 씌운다
					// 빈 칸이 없도록 뒤의 연락처들도 차례대로 덮어씌운다.
	
	//검색이름 데이터(정보)출력
}
